# TessellatedFace Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TessellatedFace Properties
TessellatedFace Class See Also
---
The TessellatedFace type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MaterialId | Material of the face. |

# See Also
TessellatedFace Class
Autodesk.Revit.DB Namespace